// pages/detail/detail.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    detaildata: {
      "id": 1523074607650,
      "title": "山东四县都想当“宋江”：谁想牵头水浒文旅，其他三地都不服",
      "date": "2018-04-07",
      "source": "新华网",
      "firstImage": "http://inews.gtimg.com/newsapp_bt/0/3203362023/641",
      "content": [
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362023/641",
          "id": 1
        },
        {
          "type": "p",
          "text": "梁山山寨的忠义堂。摄影/牛泰",
          "id": 2
        },
        {
          "type": "p",
          "text": "“宋江……荷天地之盖载，感日月之照临，聚弟兄于梁山，结英雄于水泊，共一百八人，上符天数，下合人心。”《水浒传》第七十一回说到，宋江等一百单八将齐聚水泊梁山排了座次。",
          "id": 3
        },
        {
          "type": "p",
          "text": "和一百单八将齐聚梁山不同的是，现实中的水泊梁山等水浒故地，因行政区划各自为政，水浒文旅亦如一盘散沙。",
          "id": 4
        },
        {
          "type": "p",
          "text": "3月26日，在全国省级山东商会会长座谈会上，河南省山东商会会长刘继承提议：“建议成立水浒市，把跟水浒有关联的县整合一起，统一规划，统一管理。”",
          "id": 5
        },
        {
          "type": "p",
          "text": "山东省委书记刘家义现场回应说，不但要建好水浒文化，更要讲好水浒故事。",
          "id": 6
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362024/641",
          "id": 7
        },
        {
          "type": "p",
          "text": "地理位置示意图",
          "id": 8
        },
        {
          "type": "p",
          "text": "一石激起千层浪，“水浒市”这个概念成为关注的焦点。",
          "id": 9
        },
        {
          "type": "p",
          "text": "上游新闻记者（全国新闻热线：M17702387875@163.com)在山东围绕水浒文旅调查显示：在阳谷，一边看打虎故地，一边听水浒故事；在梁山，一边看聚义之地，一边听水浒故事；在东平，一边看水泊，一边听水浒故事；在郓城，一边看宋江老家，一边听水浒故事。",
          "id": 10
        },
        {
          "type": "p",
          "text": "上述四县隶属于四个地级市管辖，虽然四个县都在讲水浒故事，但内容除了讲述本土英雄人物的优势外，毫无例外又在重复着同样的故事。",
          "id": 11
        },
        {
          "type": "p",
          "text": "当地水浒文化旅游研究人员感慨地对上游新闻记者说，水浒文化旅游难统一，就是因为缺了一个“宋江”来牵头。",
          "id": 12
        },
        {
          "type": "strong",
          "text": "聊城阳谷：景阳岗上打“道具虎”",
          "id": 13
        },
        {
          "type": "p",
          "text": "黄河之北，聊城阳谷。",
          "id": 14
        },
        {
          "type": "p",
          "text": "景阳冈位于阳谷县城东边16公里处的张秋镇境内，上游新闻记者走进景阳冈旅游区，占地700亩的景区内沙丘起伏，林荫蔽日。",
          "id": 15
        },
        {
          "type": "p",
          "text": "“三碗不过冈”酒店老板在吆喝：“景阳冈酒，透瓶香，武松喝的，两块钱一小碗，来喝啊，喝完去看打虎。”老板边说边掀开了酒坛盖，浓浓酒香飘了出来。",
          "id": 16
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362025/641",
          "id": 17
        },
        {
          "type": "p",
          "text": "景阳冈武松打虎处的一只道具虎。摄影/牛泰",
          "id": 18
        },
        {
          "type": "p",
          "text": "沿着林荫小道，走十分钟，便可见一个石碑，石碑上写着：武松打虎处。石碑旁趴着一只一米多长，半米高的道具大虫，它张着大口，面目狰狞。游人骑上它，微笑着拍照留恋。",
          "id": 19
        },
        {
          "type": "p",
          "text": "再走个10分钟，便来到了武松庙，行者武松正坐庙中，一双眼光射寒星，两弯眉浑如刷漆。导游说起了武松的故事，结拜宋江，打虎遇兄……",
          "id": 20
        },
        {
          "type": "p",
          "text": "景阳冈的两只东北虎，在离武松庙面不远处的笼中，时而躺下，时而站起踱步，游人喊个不停，也听不见虎啸。笼外挂着一个牌子：300元买一只鸡，可看老虎扑鸡表演。",
          "id": 21
        },
        {
          "type": "p",
          "text": "狮子楼在县城十字街，20公里的距离并没直达专线，如果不是自驾游或者报团出行，游客只能先转乡镇中巴到县城，再转公交。",
          "id": 22
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362026/641",
          "id": 23
        },
        {
          "type": "p",
          "text": "武松怒杀西门庆的狮子楼。摄影/牛泰",
          "id": 24
        },
        {
          "type": "p",
          "text": "狮子楼红柱灰瓦，雕梁画栋，飞角翅檐，古朴典雅。《水浒传》中描述，武松在两层高的狮子楼，为兄报仇怒杀西门庆。",
          "id": 25
        },
        {
          "type": "p",
          "text": "狮子楼20米开外有一个停车场，停车场内停满了私家车，并无旅游大巴。",
          "id": 26
        },
        {
          "type": "p",
          "text": "在阳谷旅行社总经理潘明忠看来，一个地方的旅游火不火，就看停车场里停有多少辆旅游大巴，“四辆大巴带来的游客，抵50辆私家车。”",
          "id": 27
        },
        {
          "type": "p",
          "text": "潘明忠的旅行社有阳谷一日游的专线，可玩景阳冈和狮子楼，潘明忠却说这条专线利润很低，“收旅客100元。景阳冈的门票30元，狮子楼的40元，给我的政策是7折。收100元，我要出49元的门票，要管一顿中饭，还要管交通出行，再加上人工成本，利润能有多少？我在南方景区拿票，几乎没有超过五折的。”",
          "id": 28
        },
        {
          "type": "p",
          "text": "潘明忠说，作为阳谷人，他有义务去做这条专线。可因利润低，他不敢大力去推广，否则会亏本。",
          "id": 29
        },
        {
          "type": "strong",
          "text": "济宁梁山：只有梁山没了水泊",
          "id": 30
        },
        {
          "type": "p",
          "text": "从阳谷去济宁梁山，最近的路需穿过河南省台前县。台前三面与山东6个县接壤或隔河相望。从地图上看，台前像一根牙签“插”进鲁西南大地。黄河上的将军渡浮桥，京九浮桥连着台前县与梁山县，梁山在梁山县城中间。",
          "id": 31
        },
        {
          "type": "p",
          "text": "“现实中没有108将和10万大军，只有以宋江为首的36将和一支人数不详的农民起义军。”梁山水浒研究会会长张玉生介绍，《宋史》记载江以三十六人横行齐魏，官军数万，无敢抗者。梁山是中国唯一的以古代农民起义根据地为核心内容的旅游圣地，是国家4A级景区。",
          "id": 32
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362027/641",
          "id": 33
        },
        {
          "type": "p",
          "text": "位于梁山的梁山寨。",
          "id": 34
        },
        {
          "type": "p",
          "text": "在梁山当地，百姓间流传着一句话形容水浒寨：六关八寨四水营，酒馆暗哨遍山东。",
          "id": 35
        },
        {
          "type": "p",
          "text": "上游新闻记者穿过水浒寨门，踏着台阶前行约三分钟，来到了摩崖石刻下，映入眼帘的是四个红色大字“水泊梁山”；石刻一侧，有108级台阶，走完台阶便可见断金亭，亭内一位艺人正说着“武松打虎”；亭旁是宋江便道，便道曲折回旋，道边有一个石碑，上面写着黑风口三个字，石碑旁的“李逵”喊着：“照相了，照相了，10块钱，我摆5个动作。”越过黑风口，便可直达宋江寨，宋江寨是忠义堂所在地，正对大门的上座摆着宋江、卢俊义、吴用的三把交椅，其余105将的交椅依次排开。",
          "id": 36
        },
        {
          "type": "p",
          "text": "一场劝酒情景剧在忠义堂内上演。一番武术表演后，体态发福的“宋江”说：“欢迎四海宾朋上梁山，请大家大口吃肉，大碗喝酒。”",
          "id": 37
        },
        {
          "type": "p",
          "text": "语毕，演员离场，没能尽兴的游客们喊着：“肉呢？酒呢？”……",
          "id": 38
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362029/641",
          "id": 39
        },
        {
          "type": "p",
          "text": "梁山寨上高悬的替天行道旗帜。摄影/牛泰",
          "id": 40
        },
        {
          "type": "p",
          "text": "离寨门一公里处，有一个人工打造的聚义湖，湖上有一艘宋江战船，导游介绍，战船买来已很久，但没对游客开放过。聚义湖原来是挖沙留下的坑，后来人工注水。",
          "id": 41
        },
        {
          "type": "p",
          "text": "梁山还在，可水泊只剩两个“人工水泊”，六关八寨四水营，酒馆暗稍的景象早已不在。",
          "id": 42
        },
        {
          "type": "p",
          "text": "张玉生介绍，梁山县的支柱产业是挂车和图书，旅游收入占比很少，“留不住客，两三个小时就逛完了，游客们都去济南了。”",
          "id": 43
        },
        {
          "type": "p",
          "text": "留不住客，也让梁山官方感到忧心。2018年的梁山政府报告写到，梁山将按照“山水一体、城景交融”，完成梁山泊南北水系贯通工程等，推动梁山旅游由单一观光，向娱乐、休闲、度假转型。",
          "id": 44
        },
        {
          "type": "strong",
          "text": "泰安东平：靠水泊争抢水浒风头",
          "id": 45
        },
        {
          "type": "p",
          "text": "水泊“去”哪儿了？在梁山东边40余公里外的东平县。",
          "id": 46
        },
        {
          "type": "p",
          "text": "张玉生说，北宋末年的梁山被水泊环绕。后因黄河改道，泥沙淤积，渐成平陆。",
          "id": 47
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362031/641",
          "id": 48
        },
        {
          "type": "p",
          "text": "东平湖风景名胜区。",
          "id": 49
        },
        {
          "type": "p",
          "text": "《水浒传》中的八百里水泊唯一遗存水域叫东平湖。东平湖总面积627平方公里的东平湖被二级湖堤一分为二，209平方公里的老湖区在东北方向，常年蓄水；滞洪区在东南，大部分为耕地。",
          "id": 50
        },
        {
          "type": "p",
          "text": "东平湖老湖一带原属于梁山县管辖。1985年，水泊梁山风景区成为山东省省级风景名胜区。东平湖老湖一带为称为水泊景区，梁山一带称为梁山景区。1986年1月1日，山东省下发文件，东平湖老湖由东平县统一管理。",
          "id": 51
        },
        {
          "type": "p",
          "text": "这次分家，还引发了20年后的地名官司，这场官司耗时3年，打到了省高院。",
          "id": 52
        },
        {
          "type": "p",
          "text": "“哎！打官司之前，东平的旅游局局长常来我们这做客；官司之后，关系变得尴尬了。我们搞了好几次全国性的水浒论坛，其他地方都是局长带着专家来，他们只是象征性地派一个代表，来了坐坐就走。”梁山县旅游局知情人士介绍。",
          "id": 53
        },
        {
          "type": "strong",
          "text": "知情人说，这场官司的原告是梁山风景名胜区管委会和梁山旅游开发总公司，被告是位于东平县的山东梁山泊旅游开发有限公司。",
          "id": 54
        },
        {
          "type": "strong",
          "text": "2006年6月，山东梁山泊旅游开发有限公司将腊山、六工山、东平湖分别改称前梁山、北梁山和梁山泊。此举触了梁山方面的底线，他们认为山东梁山泊旅游开发有限公司进行虚假宣传，侵犯了梁山县地名权，侵害了梁山县的合法权益，构成了不争当竞争。",
          "id": 55
        },
        {
          "type": "p",
          "text": "2007年7月，济宁市中级人民法院作出一审判决：被告立即停止使用前梁山、北梁和梁山泊名称进行虚假宣传的不正当竞争行为；被告立即停止使用带有梁字样的企业名称；被告向原赔偿经济损失50万元。",
          "id": 56
        },
        {
          "type": "p",
          "text": "泰安东平的原告并不服济宁中院的判决，遂上诉至山东省高级人民法院。2009年5月，山东省高级人民法院判决维持原判。",
          "id": 57
        },
        {
          "type": "p",
          "text": "1986年的行政区域划分，让水泊梁山风景名胜区没了水泊；2009年山东省高院的判决，使得山东梁山泊旅游开发有限公司不复存在，取而代之的是东平湖风景名胜区。",
          "id": 58
        },
        {
          "type": "p",
          "text": "该景区吕姓负责人介绍，景区是国内水浒传说遗迹最密集、传说故事最集中，《水浒传》风貌保留完好，形象最真切的旅游地、是唯一能够让人体会到水泊与山寨、山阔与水险、芦荡与港汊并存的原始地域。内有水浒影视城，六工山水浒大寨，聚义岛。",
          "id": 59
        },
        {
          "type": "strong",
          "text": "菏泽郓城：没有宋江就没有水浒传",
          "id": 60
        },
        {
          "type": "p",
          "text": "东平说是水浒传说遗迹最密集、传说故事最集中的地方，梁山县西南30公里外的郓城人并不买账。",
          "id": 61
        },
        {
          "type": "p",
          "text": "郓城花巨资在央视打的广告说，水浒一百单八将七十二名在郓城。",
          "id": 62
        },
        {
          "type": "p",
          "text": "中国水浒协会理事、《郓城七十二汉别传》作者鲁明说，《水浒传》是一部小说，得出七十二名在郓城的结论并不是依据历史，而是依据郓城民间流传的说法。",
          "id": 63
        },
        {
          "type": "p",
          "text": "“郓城是千年古县，咱郓城老百姓都说七十二名好汉在我们这，代代相传。再说北宋末年，梁山的一部分都归郓城管，《水浒传》讲的故事投射到郓城，可以找到三分之二，一百零八乘以三分之二就是七十二。”鲁明说。",
          "id": 64
        },
        {
          "type": "p",
          "text": "郓城人没有去争“遗迹最密集”“故事最密集”，他们讲的水浒故事更侧重于宋江。",
          "id": 65
        },
        {
          "type": "p",
          "text": "“没有宋江就没有水浒传；没有智取生辰纲，就没有后来的上梁山；郓城的水堡乡是宋江的老家，黄泥冈在郓城。”鲁明强调。",
          "id": 66
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362034/641",
          "id": 67
        },
        {
          "type": "p",
          "text": "宋江旧居宋宅。摄影/牛泰",
          "id": 68
        },
        {
          "type": "p",
          "text": "宋江老家水堡乡政府相关人士介绍，目前，该乡已建成宋江故里旅游业开发的首期工程宋江故里仿宋商业街，该项目总投资1600万元，建筑面积1.1万平方米，全部是仿宋建筑风格。宋江故里的旅游开发，将为该乡旅游业带来较好的经济效益和社会效益。",
          "id": 69
        },
        {
          "type": "image",
          "src": "http://inews.gtimg.com/newsapp_bt/0/3203362036/641",
          "id": 70
        },
        {
          "type": "p",
          "text": "水浒好汉城。",
          "id": 71
        },
        {
          "type": "p",
          "text": "水堡乡的旅游项目建设已初具规模，县城西门街的水浒好汉城早已开门迎客。4月2日，记者走进好汉城，仿古建筑荟萃，雕梁画栋赏心悦目。深藏在郓城县衙、晁家庄等仿古建筑里的水浒传奇故事，令人浮想联翩；房屋外的青石板路上，宋江武校的学生们表演的武术，游客纷纷拍手叫好。",
          "id": 72
        },
        {
          "type": "strong",
          "text": "各自为政下的水浒文旅呼唤“宋江”头领",
          "id": 73
        },
        {
          "type": "p",
          "text": "阳谷、梁山、东平、郓城，分属山东四市的四县，都是水浒故事的发祥地，也都算水浒故里。",
          "id": 74
        },
        {
          "type": "p",
          "text": "“水浒市”这个概念初衷是想让水浒文旅这块金字招牌真正火起来，说出了四地人的心愿。多位接受上游新闻采访的专家、官员、旅行社相关人员介绍，成立水浒市的说法是第一次听说，让人很兴奋，但后来都不敢议论了。",
          "id": 75
        },
        {
          "type": "p",
          "text": "提议成立水浒市的河南山东商会会长刘继承，祖籍山东，是郑州市友谊商业公司总经理。上游新闻记者了解到，3月29日，刘继承的同事通过自媒体发出成立水浒市的文章后，引发疯狂转发，但次日这篇文章就被删除。",
          "id": 76
        },
        {
          "type": "p",
          "text": "与水浒相关的山东四地的部分官员在朋友圈转发此文章后，也挨了批评，“被批评的原因是不懂规矩，瞎起哄，成立水浒市是省里考虑的事。梁山的位置在中心，就想当把市政府设在梁山？郓城的人口比梁山多，经济总量比梁山大，难道不想把市政府机构设在郓城？”",
          "id": 77
        },
        {
          "type": "p",
          "text": "成立水浒市是第一次提及，但“水浒旅游专线”“山东十大旅游目的地水浒故里”的意见至少实施了六年。六年下来，四地的游客数量年年增长，都没能改变水浒旅游不温不火的面貌。",
          "id": 78
        },
        {
          "type": "strong",
          "text": "多位受访人士介绍四县分属山东四市，谁想牵头水浒文旅，其他三地都不会服气，这就造成了各自说好各自故事的局面。也造成了景点建设重复，郓城水浒好汉城可以拍电影电视，东平的水浒影视城也在拍电视；东平有天然遗存水泊，梁山在修建人工水泊，郓城正在开发宋金河，说紧邻八百里水泊。",
          "id": 79
        },
        {
          "type": "p",
          "text": "上游新闻记者了解到，各旅行社均有四地游的水浒文旅专线，但他们更愿意在专线中或去掉郓城，或去掉东平。原因是不让游客生出“重复游玩”的感觉。",
          "id": 80
        },
        {
          "type": "p",
          "text": "交通问题是最大的障碍。黄河将阳谷与梁山隔开，黄河上只有两座浮桥，旅游大巴通行存在安全隐患。“架桥，还要与河南的台前商量；修一条环线出来，跨了两省五市。”",
          "id": 81
        },
        {
          "type": "p",
          "text": "此外，旅行社觉得利润不大，不敢大张旗鼓地去做地接，带来的结果是外地游客不多。",
          "id": 82
        },
        {
          "type": "p",
          "text": "鲁西南经济欠发达，文化旅游配套设施不完善，也是造成当前窘况的一个主要原因。",
          "id": 83
        },
        {
          "type": "p",
          "text": "“四个地方不去遗憾，去了也遗憾。”不少游客走完一圈水浒游之后会有这样的感慨。",
          "id": 84
        },
        {
          "type": "p",
          "text": "“水浒文化旅游难统一，就是因为缺了一个‘宋江’来牵头，谁都想当“宋江”，谁都不服谁。”当地水浒文化旅游研究人员说。",
          "id": 85
        },
        {
          "type": "p",
          "text": "（原标题为《 上游深阅读丨山东要建水浒市？四个县都想当“宋江”》）",
          "id": 86
        }
      ],
      "readCount": 1643
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.request({
      url: 'https://test-miniprogram.com/api/news/detail',
      data: {
        id: options.id
      },
      success: res => {
        let result = res.data.result
        this.setArticle(result)
      },
      complete: () => {
      }
    })
  },
  setArticle(result){
    console.log(result)
    result.date = result.date.split('T')[0]
    this.setData({
      detaildata: result
    })
  }

})